package com.homework;

/**
 * 案例题目描述：
 * 1. 做一个Student类，Student类有名称(name),性别(sex),年龄(age)学号(stu id),做合理封装，通过构造器在创建对象时将4个属性赋值。
 * 2. 写一个Teacher类，Teacher类有名称(name),性别(sex),年龄(age),工龄(work age),做合理封装，通过构造器在创建对象时将4个属性赋值。
 * 3. 抽取一个父类Person类，将共同属性和方法放到Person类
 * 4. 学生需要有学习的方法(study),在方法里写生“我承诺，我会好好学习。”。
 * 5. 教师需要有教学的方法(teach),在方法里写上“我承诺，我会认真教学。”。
 * 6. 学生和教师都有玩的方法(play),学会玩的是足球，老师玩的是象棋，此方法是返回字符串的，分别返回“xx爱玩足球”和“xx爱玩象棋”
 *    (其中x分别代表学生和老师的姓名)。因为玩的方法名称都一样，所以要求此方法定义在父类中，子类实现重写。
 * 7. 定义多态数组，里面保存2个学生和2个教师，要求按年龄从高到低排序，
 * 8. 定义方法，形参为Person类型，功能：调用学生的study或教师的teach方法
 */
public class Homework13 {
}
